/**
 ******************************************************************************
 ** ファイル名 : default.cpp
 **
 ** 概要 : defaultクラス
 **
 ** 注記 : 各種初期パラメータは_prmファイル参照
 ******************************************************************************
 **/

#include "default.h"
#include "default_prm.h"

#define DEBUG

#ifdef DEBUG
#define _debug(x) (x)
#else
#define _debug(x)
#endif

//*****************************************************************************
// 関数名 : コンストラクタ
// 引数 : unused
// 返り値 : なし
// 概要 : 
//*****************************************************************************
default::default(){

}

//*****************************************************************************
// 関数名 : デストラクタ
// 引数 : unused
// 返り値 : なし
// 概要 : 
//*****************************************************************************
default::~default(){

}

//*****************************************************************************
// 関数名 : defaultCalibra
// 引数 : default_CALIBRA s_calibra
// 返り値 : なし
// 概要 : 全てのモータのキャリブレーションを設定する
//*****************************************************************************
void default::defaultCalibra(default_CALIBRA s_calibra){
	defualt_Offset[default_NO] = s_calibra.Offset[default_NO];
}

//*****************************************************************************
// 関数名 : defaultReset
// 引数 : int8_t motorBit
// 返り値 : なし
// 概要 : 指定したモータをリセットする
//*****************************************************************************
void default::defaultReset(int8_t motorBit){
	if((motorBit&default_LEFT_BIT)>0){
		leftMotor->reset();
	}
	if((motorBit&default_RIGHT_BIT)>0){
		rightMotor->reset();
	}
	if((motorBit&default_TAIL_BIT)>0){
		tailMotor->reset();
	}
}
